ivan-gluscic101/STM32-ESP32-Microphone-Array-Sound-Localization/Sound Localization/Core/Inc/FreeRTOSConfig.h
/* USER CODE BEGIN Header */
/*
 * FreeRTOS Kernel V10.3.1
 * FreeRTOSConfig.h — ISPRAVLJENO
 *
 * ISPRAVKE:
 *
 *   1. configENABLE_FPU: 0 → 1
 *      STM32G474 ima hardverski FPU (Cortex-M4F).
 *      processTask koristi float (asinf, množenja, dijeljenja u LOC_Process).
 *      Bez ove postavke FreeRTOS NE čuva FPU registre pri context switchu.
 *      Ako scheduler preemptira processTask usred float operacije
 *      i drugi task dotakne float, FPU registri se pokvare.
 *      S configENABLE_FPU=1, lazy stacking čuva FPU kontekst samo kad treba.
 *
 *   2. configTOTAL_HEAP_SIZE: 12288 → 20480 (20 KB)
 *      Novi raspored:
 *        - ACQ_Task stack:    256 words × 4 =  1024 B
 *        - FFT_Task stack:    512 words × 4 =  2048 B
 *        - UART_Task stack:   256 words × 4 =  1024 B
 *        - 3 queue-a + overhead:               ~600 B
 *        - Ukupno RTOS:                       ~4.7 KB
 *        - Slobodno za buduće taskove:        ~15 KB
 *      STM32G474RE ima 128 KB RAM-a, 20 KB heap je samo 15.6%.
 *
 *   3. configUSE_TIME_SLICING eksplicitno postavljeno na 1
 *      Originalno nije bilo definirano (koristio se default=1).
 *      Eksplicitnost je bolja od implicitnog oslanjanja na default.
 */
/* USER CODE END Header */

#ifndef FREERTOS_CONFIG_H
#define FREERTOS_CONFIG_H

/*-----------------------------------------------------------
 * Application specific definitions.
 *
 * These definitions should be adjusted for your particular hardware and
 * application requirements.
 *
 * These parameters and more are described within the 'configuration' section of the
 * FreeRTOS API documentation available on the FreeRTOS.org web site.
 *
 * See http://www.freertos.org/a00110.html
 *----------------------------------------------------------*/

/* USER CODE BEGIN Includes */
/* USER CODE END Includes */

/* Ensure definitions are only used by the compiler, and not by the assembler. */
#if defined(__ICCARM__) || defined(__CC_ARM) || defined(__GNUC__)
  #include <stdint.h>
  #include "stm32g4xx.h"
  extern uint32_t SystemCoreClock;
#endif
#define configENABLE_FPU                         1
#define configENABLE_MPU                         0

#define configUSE_PREEMPTION                     1
#define configSUPPORT_STATIC_ALLOCATION          0
#define configSUPPORT_DYNAMIC_ALLOCATION         1
#define configUSE_IDLE_HOOK                      0
#define configUSE_TICK_HOOK                      0
#define configCPU_CLOCK_HZ                       ( SystemCoreClock )
#define configTICK_RATE_HZ                       ((TickType_t)1000)
#define configMAX_PRIORITIES                     ( 7 )
#define configMINIMAL_STACK_SIZE                 ((uint16_t)128)
#define configTOTAL_HEAP_SIZE                    ((size_t)16384)
#define configMAX_TASK_NAME_LEN                  ( 16 )
#define configUSE_16_BIT_TICKS                   0
#define configUSE_MUTEXES                        1
#define configQUEUE_REGISTRY_SIZE                8
#define configUSE_PORT_OPTIMISED_TASK_SELECTION  1
/* USER CODE BEGIN MESSAGE_BUFFER_LENGTH_TYPE */
/* Defaults to size_t for backward compatibility, but can be changed
   if lengths will always be less than the number of bytes in a size_t. */
#define configMESSAGE_BUFFER_LENGTH_TYPE         size_t
/* USER CODE END MESSAGE_BUFFER_LENGTH_TYPE */

/* Co-routine definitions. */
#define configUSE_CO_ROUTINES                    0
#define configMAX_CO_ROUTINE_PRIORITIES          ( 2 )

/* The following flag must be enabled only when using newlib */
#define configUSE_NEWLIB_REENTRANT          1

/* Set the following definitions to 1 to include the API function, or zero
to exclude the API function. */
#define INCLUDE_vTaskPrioritySet             1
#define INCLUDE_uxTaskPriorityGet            1
#define INCLUDE_vTaskDelete                  1
#define INCLUDE_vTaskCleanUpResources        0
#define INCLUDE_vTaskSuspend                 1
#define INCLUDE_vTaskDelayUntil              0
#define INCLUDE_vTaskDelay                   1
#define INCLUDE_xTaskGetSchedulerState       1

/* Cortex-M specific definitions. */
#ifdef __NVIC_PRIO_BITS
 /* __BVIC_PRIO_BITS will be specified when CMSIS is being used. */
 #define configPRIO_BITS         __NVIC_PRIO_BITS
#else
 #define configPRIO_BITS         4
#endif

/* The lowest interrupt priority that can be used in a call to a "set priority"
function. */
#define configLIBRARY_LOWEST_INTERRUPT_PRIORITY   15

/* The highest interrupt priority that can be used by any interrupt service
routine that makes calls to interrupt safe FreeRTOS API functions.  DO NOT CALL
INTERRUPT SAFE FREERTOS API FUNCTIONS FROM ANY INTERRUPT THAT HAS A HIGHER
PRIORITY THAN THIS! (higher priorities are lower numeric values. */
#define configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY 5

/* Interrupt priorities used by the kernel port layer itself.  These are generic
to all Cortex-M ports, and do not rely on any particular library functions. */
#define configKERNEL_INTERRUPT_PRIORITY 		( configLIBRARY_LOWEST_INTERRUPT_PRIORITY << (8 - configPRIO_BITS) )
/* !!!! configMAX_SYSCALL_INTERRUPT_PRIORITY must not be set to zero !!!!
See http://www.FreeRTOS.org/RTOS-Cortex-M3-M4.html. */
#define configMAX_SYSCALL_INTERRUPT_PRIORITY 	( configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY << (8 - configPRIO_BITS) )

/* Normal assert() semantics without relying on the provision of an assert.h
header file. */
/* USER CODE BEGIN 1 */
#define configASSERT( x ) if ((x) == 0) {taskDISABLE_INTERRUPTS(); for( ;; );}
/* USER CODE END 1 */

/* Definitions that map the FreeRTOS port interrupt handlers to their CMSIS
standard names. */
#define vPortSVCHandler    SVC_Handler
#define xPortPendSVHandler PendSV_Handler

/* IMPORTANT: This define is commented when used with STM32Cube firmware, when the timebase source is SysTick,
              to prevent overwriting SysTick_Handler defined within STM32Cube HAL */

#define xPortSysTickHandler SysTick_Handler

/* USER CODE BEGIN Defines */
#define configUSE_TRACE_FACILITY                 1
#define configGENERATE_RUN_TIME_STATS            1
#define configUSE_STATS_FORMATTING_FUNCTIONS     1

/* DWT cycle counter kao izvor timestamps-a za runtime stats.
 * Na 170 MHz wrapa se svakih ~25 s — dovoljno za debug snapshot. */
#define portCONFIGURE_TIMER_FOR_RUN_TIME_STATS() do {          \
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;            \
    DWT->CYCCNT = 0u;                                           \
    DWT->CTRL  |= DWT_CTRL_CYCCNTENA_Msk;                      \
} while(0)
#define portGET_RUN_TIME_COUNTER_VALUE()         (DWT->CYCCNT / 170u)
/* USER CODE END Defines */

#endif /* FREERTOS_CONFIG_H */
